Revit 2026 API

# ViewGenLevel Property

---

The level for the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Level GenLevel { get; }
```
```vb
Public ReadOnly Property GenLevel As Level
	Get
```
```cpp
public:
property Level^ GenLevel {
	Level^ get ();
}
```
```fsharp
member GenLevel : Level with get
```

#### Property Value

Level

This will obtain the level for views related to levels, such as Plan Views. If this View is not generated by a level, this property is .

#### Reference

View Class

Autodesk.Revit.DB Namespace